Tip.org
#+AUTHOR: [[http://blog.saisimon.net][Saisimon]]

#+BEGIN_HTML
<link rel="stylesheet" href="css/main.css" >
#+END_HTML

* Tip
** Windows
*** 右键添加命令提示符(CMD)
    1. Win + R 运行 regedit
    2. 找到 计算机 > HKEY_CLASSES_ROOT > Folder > shell
    3. 右键shell 新建 -> 项 -> 命令提示符
    4. 右键命令提示符 新建 -> 项 -> command
    5. 点击(默认)项 输入 C:\Windows\System32\cmd.exe /k cd %1 然后点击确认
*** 修改 XShell Alt 键作为 Meta 键, Backspace 键作为删除键
    1. 打开XShell 选择 文件 -> 属性
    2. 选择 终端 -> 键盘
    3. 选中 将 Alt 用作 Meta 键
    4. BACKSPACE 键序列 中选择 ASCII 127 确认
*** 常见文件头特征（魔数）
    | jpg            | FF D8 FF                      | png         | 89 50 4E 47    |
    | gif            | 47 49 46 38                   | bmp         | 42 4D          |
    | pdf            | 25 50 44 46                   | xml         | 3C 3F 78 6D 6C |
    | docx/xlsx/pptx | 50 4B 03 04 14 00 06 00 08 00 | doc/xls/ppt | D0 CF 11 E0    |
    | zip            | 50 4B 03 04                   | rar         | 52 61 72 21    |
    | avi            | 41 56 49 20                   | class       | ca fe ba be    |
    | exe            | 4D 5A 90 00 03                | psd         | 38 42 50 53    |
    [[https://en.wikipedia.org/wiki/Magic_number_(programming)][更多]]
** Linux
*** 查看 linux 内存占用
    1. 使用 [[http://man.linuxde.net/top][top]] 命令来查看各个进程的使用情况
    2. 按 Shift + m ,即 M 按内存占用率排序
*** linux 解压 ([[http://man.linuxde.net/tar][tar]] 命令、[[http://man.linuxde.net/unzip][unzip]] 命令)
    #+BEGIN_SRC
      1. 解压 .tar 文件
      $ tar -xf *.tar

      2. 解压 .tar.gz 文件
      $ tar -xzf *.tar.gz

      3. 解压 .tar.xz 文件
      $ xz -d *.tar.xz
      $ tar -xf *.tar

      4. 解压 .tar.bz2 文件 
      $ tar -jxvf *.tar.bz2
      - 如果tar不支持j选项，就用下面方式解压
      $ bzip2 -d  *.tar.bz2
      $ tar -xvf  *.tar.bz2

      5. 解压 .tar.Z 文件
      $ tar -xZf *.tar.Z

      6. 解压 .zip 文件
      $ unzip *.zip

      7. 解压到指定路径
      $ tar -xzvf *.tar.gz -C ~/dic/
      $ unzip *.zip -d ~/dic/
    #+END_SRC
*** linux 下 nginx 安装、启动、重启、停止
    安装
    #+BEGIN_SRC 
      tar -xzf nginx-${version}.tar.gz
      cd nginx-${version}
      yum install -y pcre-devel openssl-devel
      ./configure 
      make
      make install
    #+END_SRC
    nginx 默认安装路径 
    #+BEGIN_SRC 
      /usr/local/nginx
    #+END_SRC
    启动 
    #+BEGIN_SRC 
      ${nginx_path}/sbin/nginx
    #+END_SRC
    启动指定配置文件 
    #+BEGIN_SRC 
      ${nginx_path}/sbin/nginx -c ${conf_path}
    #+END_SRC
    重启 
    #+BEGIN_SRC 
      ${nginx_path}/sbin/nginx -s reload
    #+END_SRC
    停止 
    #+BEGIN_SRC 
      ${nginx_path}/sbin/nginx -s stop
    #+END_SRC
*** nginx 反向代理配置
    在 http-server-location / 下填写反向代理配置
    #+BEGIN_SRC
      proxy_pass http://localhost:8080;
      proxy_set_header Host $host;
      proxy_set_header X-Real-IP $remote_addr;
      proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
    #+END_SRC
*** linux 下安装 cheat 命令
    - 通过 pip 安装 cheat
    #+BEGIN_SRC 
    - 安装 python 和 pip
      $ yum install python-pip -y
    - 更新 pip
      $ pip install --upgrade pip
    - 安装 cheat
      $ pip install cheat
    #+END_SRC
    - 通过 github 下载源码安装 cheat
    #+BEGIN_SRC 
    - 安装 python 和 pip
      $ yum install python-pip -y
    - 更新 pip
      $ pip install --upgrade pip
    - 安装编译工具
      $ pip install docopt pygments appdirs
    - clone cheat 源码
      $ git clone git@github.com:chrisallenlane/cheat.git
    - 进入源码目录
      $ cd cheat
    - 编译安装 cheat
      $ python setup.py install
    #+END_SRC
*** linux 设置命令别名
    - 列出目前所有的别名设置
      #+BEGIN_SRC 
      $ alias
      alias l.='ls -d .* --color=auto'
      alias ll='ls -l --color=auto'
      alias ls='ls --color=auto'
      alias vi='vim'
      #+END_SRC
    - 设置指令的别名(本次登录有效)
      #+BEGIN_SRC 
      $ alias [别名]=[指令名称]
      $ alias la='ls -a'
      $ alias cp='cp -i'
      #+END_SRC
    - 每次登录自动设置，修改自己的配置文件
      #+BEGIN_SRC
      # 编辑配置文件
      $ vim ~/.bash_profile
      # 配置别名
      alias ..='cd ..'
      alias cp='cp -i'
      alias df='df -h'
      alias home='cd ~'
      alias l.='ls -d .* --color=auto'
      alias la='ls -a --color=auto'
      alias ll='ls -l --color=auto'
      alias ls='ls --color=auto'
      alias targz='tar -xzvf'
      alias vi='vim'
      # 重新加载配置文件
      $ source .bash_profile
      #+END_SRC

** Database
*** Mysql
