Tip.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tip</title>
<!-- 2016-09-28 Wed 11:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="[[http://blog.saisimon.net][Saisimon]]Saisimon" />
<link rel="stylesheet" href="css/main.css" >
</head>
<body>
<div id="content">
<h1 class="title">Tip</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tip</a>
<ul>
<li><a href="#sec-1-1">1.1. Windows</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 右键添加命令提示符(CMD)</a></li>
<li><a href="#sec-1-1-2">1.1.2. 修改 XShell Alt 键作为 Meta 键, Backspace 键作为删除键</a></li>
<li><a href="#sec-1-1-3">1.1.3. 常见文件头特征（魔数）</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Linux</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 查看 linux 内存占用</a></li>
<li><a href="#sec-1-2-2">1.2.2. linux 解压 (tar 命令、unzip 命令)</a></li>
<li><a href="#sec-1-2-3">1.2.3. linux 下 nginx 安装、启动、重启、停止</a></li>
<li><a href="#sec-1-2-4">1.2.4. nginx 反向代理配置</a></li>
<li><a href="#sec-1-2-5">1.2.5. linux 下安装 cheat 命令</a></li>
<li><a href="#sec-1-2-6">1.2.6. linux 设置命令别名</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Database</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Mysql</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Java</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Java</a></li>
<li><a href="#sec-1-4-2">1.4.2. Web</a></li>
<li><a href="#sec-1-4-3">1.4.3. Maven</a></li>
<li><a href="#sec-1-4-4">1.4.4. Tomcat</a></li>
<li><a href="#sec-1-4-5">1.4.5. JNI</a></li>
<li><a href="#sec-1-4-6">1.4.6. 多线程</a></li>
<li><a href="#sec-1-4-7">1.4.7. Solr</a></li>
<li><a href="#sec-1-4-8">1.4.8. Eclipse</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Python</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. SCons</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. JavaScript</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. JavaScript</a></li>
<li><a href="#sec-1-6-2">1.6.2. JQuery</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7. Emacs</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1. 安装 Emacs 时，error: The required function `tputs' was not found in any library</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8. Git</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1. Git 基本操作</a></li>
<li><a href="#sec-1-8-2">1.8.2. 更新 .gitignore 后，清理 Git 仓库</a></li>
<li><a href="#sec-1-8-3">1.8.3. Git 在 push 之前撤回最近一次 commit 命令</a></li>
<li><a href="#sec-1-8-4">1.8.4. 修改 Git 别名</a></li>
<li><a href="#sec-1-8-5">1.8.5. Git 推送代码</a></li>
<li><a href="#sec-1-8-6">1.8.6. Git 拉取代码</a></li>
<li><a href="#sec-1-8-7">1.8.7. 添加新 ssh<sub>key</sub> 至 Github</a></li>
<li><a href="#sec-1-8-8">1.8.8. Git status 输出中文为 UNICODE 解决方法</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tip</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Windows</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 右键添加命令提示符(CMD)</h4>
<div class="outline-text-4" id="text-1-1-1">
<ol class="org-ol">
<li>Win + R 运行 regedit
</li>
<li>找到 计算机 &gt; HKEY<sub>CLASSES</sub><sub>ROOT</sub> &gt; Folder &gt; shell
</li>
<li>右键shell 新建 -&gt; 项 -&gt; 命令提示符
</li>
<li>右键命令提示符 新建 -&gt; 项 -&gt; command
</li>
<li>点击(默认)项 输入 C:\Windows\System32\cmd.exe /k cd %1 然后点击确认
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 修改 XShell Alt 键作为 Meta 键, Backspace 键作为删除键</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>打开XShell 选择 文件 -&gt; 属性
</li>
<li>选择 终端 -&gt; 键盘
</li>
<li>选中 将 Alt 用作 Meta 键
</li>
<li>BACKSPACE 键序列 中选择 ASCII 127 确认
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 常见文件头特征（魔数）</h4>
<div class="outline-text-4" id="text-1-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">jpg</td>
<td class="left">FF D8 FF</td>
<td class="left">png</td>
<td class="left">89 50 4E 47</td>
</tr>

<tr>
<td class="left">gif</td>
<td class="left">47 49 46 38</td>
<td class="left">bmp</td>
<td class="left">42 4D</td>
</tr>

<tr>
<td class="left">pdf</td>
<td class="left">25 50 44 46</td>
<td class="left">xml</td>
<td class="left">3C 3F 78 6D 6C</td>
</tr>

<tr>
<td class="left">docx/xlsx/pptx</td>
<td class="left">50 4B 03 04 14 00 06 00 08 00</td>
<td class="left">doc/xls/ppt</td>
<td class="left">D0 CF 11 E0</td>
</tr>

<tr>
<td class="left">zip</td>
<td class="left">50 4B 03 04</td>
<td class="left">rar</td>
<td class="left">52 61 72 21</td>
</tr>

<tr>
<td class="left">avi</td>
<td class="left">41 56 49 20</td>
<td class="left">class</td>
<td class="left">ca fe ba be</td>
</tr>

<tr>
<td class="left">exe</td>
<td class="left">4D 5A 90 00 03</td>
<td class="left">psd</td>
<td class="left">38 42 50 53</td>
</tr>
</tbody>
</table>
<p>
<a href="https://en.wikipedia.org/wiki/Magic_number_(programming)">更多</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Linux</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 查看 linux 内存占用</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>使用 <a href="http://man.linuxde.net/top">top</a> 命令来查看各个进程的使用情况
</li>
<li>按 Shift + m ,即 M 按内存占用率排序
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> linux 解压 (<a href="http://man.linuxde.net/tar">tar</a> 命令、<a href="http://man.linuxde.net/unzip">unzip</a> 命令)</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
1. 解压 .tar 文件
$ tar -xf *.tar

2. 解压 .tar.gz 文件
$ tar -xzf *.tar.gz

3. 解压 .tar.xz 文件
$ xz -d *.tar.xz
$ tar -xf *.tar

4. 解压 .tar.bz2 文件 
$ tar -jxvf *.tar.bz2
- 如果tar不支持j选项，就用下面方式解压
$ bzip2 -d  *.tar.bz2
$ tar -xvf  *.tar.bz2

5. 解压 .tar.Z 文件
$ tar -xZf *.tar.Z

6. 解压 .zip 文件
$ unzip *.zip

7. 解压到指定路径
$ tar -xzvf *.tar.gz -C ~/dic/
$ unzip *.zip -d ~/dic/
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> linux 下 nginx 安装、启动、重启、停止</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
安装
</p>
<pre class="example">
tar -xzf nginx-${version}.tar.gz
cd nginx-${version}
yum install -y pcre-devel openssl-devel
./configure 
make
make install
</pre>
<p>
nginx 默认安装路径 
</p>
<pre class="example">
/usr/local/nginx
</pre>
<p>
启动 
</p>
<pre class="example">
${nginx_path}/sbin/nginx
</pre>
<p>
启动指定配置文件 
</p>
<pre class="example">
${nginx_path}/sbin/nginx -c ${conf_path}
</pre>
<p>
重启 
</p>
<pre class="example">
${nginx_path}/sbin/nginx -s reload
</pre>
<p>
停止 
</p>
<pre class="example">
${nginx_path}/sbin/nginx -s stop
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> nginx 反向代理配置</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
在 http-server-location / 下填写反向代理配置
</p>
<pre class="example">
proxy_pass http://localhost:8080;
proxy_set_header Host $host;
proxy_set_header X-Real-IP $remote_addr;
proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> linux 下安装 cheat 命令</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>通过 pip 安装 cheat
</li>
</ul>
<pre class="example">
- 安装 python 和 pip
  $ yum install python-pip -y
- 更新 pip
  $ pip install --upgrade pip
- 安装 cheat
  $ pip install cheat
</pre>
<ul class="org-ul">
<li>通过 github 下载源码安装 cheat
</li>
</ul>
<pre class="example">
- 安装 python 和 pip
  $ yum install python-pip -y
- 更新 pip
  $ pip install --upgrade pip
- 安装编译工具
  $ pip install docopt pygments appdirs
- clone cheat 源码
  $ git clone git@github.com:chrisallenlane/cheat.git
- 进入源码目录
  $ cd cheat
- 编译安装 cheat
  $ python setup.py install
</pre>
</div>
</div>
<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> linux 设置命令别名</h4>
<div class="outline-text-4" id="text-1-2-6">
<ul class="org-ul">
<li>列出目前所有的别名设置
<pre class="example">
$ alias
alias l.='ls -d .* --color=auto'
alias ll='ls -l --color=auto'
alias ls='ls --color=auto'
alias vi='vim'
</pre>
</li>
<li>设置指令的别名(本次登录有效)
<pre class="example">
$ alias [别名]=[指令名称]
$ alias la='ls -a'
$ alias cp='cp -i'
</pre>
</li>
<li>每次登录自动设置，修改自己的配置文件
<pre class="example">
# 编辑配置文件
$ vim ~/.bash_profile
# 配置别名
alias ..='cd ..'
alias cp='cp -i'
alias df='df -h'
alias home='cd ~'
alias l.='ls -d .* --color=auto'
alias la='ls -a --color=auto'
alias ll='ls -l --color=auto'
alias ls='ls --color=auto'
alias targz='tar -xzvf'
alias vi='vim'
# 重新加载配置文件
$ source .bash_profile
</pre>
</li>
</ul>
</div>
</div>
</div>
