Tip.org
**** 查询 Mysql 数据库大小
    - 选择指定 [[http://dev.mysql.com/doc/refman/5.7/en/tables-table.html][information_schema 数据库]]
      #+BEGIN_SRC sql
            use information_schema;
      #+END_SRC
    - 查询整个数据库大小
      #+BEGIN_SRC sql
            select concat(round(sum(DATA_LENGTH/1024/1024),2),'MB') as data from TABLES;
      #+END_SRC
    - 查询指定数据库大小
      #+BEGIN_SRC sql
            select concat(round(sum(DATA_LENGTH/1024/1024),2),'MB') as data from TABLES where table_schema='your_database_name';
      #+END_SRC
    - 查询指定数据库下某个表的大小
      #+BEGIN_SRC sql
            select concat(round(sum(DATA_LENGTH/1024/1024),2),'MB') as data from TABLES where table_schema='your_database_name' and table_name='your_table_name';
      #+END_SRC
**** Mysql 数据库存中文字符乱码解决方法
    - 修改 [[http://dev.mysql.com/doc/connector-j/5.1/en/connector-j-reference-configuration-properties.html][jdbc.url 配置]]
      #+BEGIN_SRC 
            jdbc.url=jdbc:mysql://ip-address:port/your_database_name?useUnicode=true&characterEncoding=utf8
      #+END_SRC
**** Mysql 新增用户, 并附指定权限
    - [[http://dev.mysql.com/doc/refman/5.7/en/adding-users.html][新增用户]]
      #+BEGIN_SRC sql
            create user ['username']@['localhost'] identified by ['password'];
      #+END_SRC
    - [[http://dev.mysql.com/doc/refman/5.7/en/adding-users.html][附指定权限]]
      #+BEGIN_SRC sql
            grant all privileges on [database].[table] to ['username']@['localhost'];
      #+END_SRC
    - [[http://dev.mysql.com/doc/refman/5.7/en/removing-users.html][删除用户]]
      #+BEGIN_SRC sql
            drop user ['username']@['localhost'];
      #+END_SRC
      
** C
*** C
**** 位操作
     #+BEGIN_SRC c
     int value;
     // 将指定位设置为1
     value = value | (1 << bit_number);
     // 将指定位设置为0
     value = value & ~ (1 << bit_number);
     // 判断指定位是否为1，为1时表达式结果为非零，0时表达式结果为0
     int flag = value & (1 << bit_number);
     if (flag) {
             printf("第%d位值为1", bit_number);
     } else {
             printf("第%d位值为0", bit_number);
     }
     #+END_SRC
** Java
*** Java
**** 操作 jar 包
     #+BEGIN_SRC 
     - 查看 jar 包中的内容
       $ jar -tf *.jar
     - 解压出 jar 包中的内容
       $ jar -xf *.jar
     #+END_SRC
**** byte 数组与 int 互转
     #+BEGIN_SRC java
     private int byteArrayToInt(byte[] bytes) {
         int value = 0;
         for (int i = 0; i < 4; i++) {
             int shift = (4 - 1 - i) * 8;
             value += (bytes[i] & 0x000000FF) << shift;
         }
         return value;
     }

     private byte[] intToByteArray(int i) {
         byte[] result = new byte[4];
         result[0] = (byte) ((i >> 24) & 0xFF);
         result[1] = (byte) ((i >> 16) & 0xFF);
         result[2] = (byte) ((i >> 8) & 0xFF);
         result[3] = (byte) (i & 0xFF);
         return result;
     }
     #+END_SRC
**** 倒序遍历 LinkedHashMap 集合
     #+BEGIN_SRC java
     Map<Integer, String> data = new LinkedHashMap<>();
     for (int i = 0; i < 5; i++) {
         data.put(i, "A" + i);
     }
     ListIterator<Map.Entry<Integer, String>> it = new ArrayList<>(data.entrySet()).listIterator(data.size());
     while (it.hasPrevious()) {
         Map.Entry<Integer, String> entry = it.previous();
         System.out.println("key : " + entry.getKey() + " value : " + entry.getValue());
     }
     #+END_SRC
**** 使用异或操作交换两个数字
     #+BEGIN_SRC java
     /**
       a = a ^ b;
       b = b ^ a;
       a = a ^ b;
     */
     private void swap(int[] nums, int a, int b) {
             nums[a] = nums[a] ^ nums[b];
             nums[b] = nums[b] ^ nums[a];
             nums[a] = nums[a] ^ nums[b];
     }
     #+END_SRC
**** 分页计算页数
     #+BEGIN_SRC java
     // 每页记录数
     int pageSize;
     // 总记录数
     int rowCount;
     // 页数
     int pageCount = (rowCount - 1) / pageSize + 1;
     #+END_SRC
**** 分割 Map
     #+BEGIN_SRC java
     /**
     ,* 当数据量较少时，该方法较全部遍历的效率要低
     ,* 当数据量较大且分割大小远小于总数据量时，该方法效率较高
     ,*/
     import com.google.common.base.Predicates;
     import com.google.common.collect.Maps;

     // map 为待分割 map 集合
     // 分割大小
     int size = 10000;
     // map 总大小
     int all = map.size();
     // 分割结果
     List<Map<String, Integer>> res = new ArrayList<>();
     // key 的 list 集合
     List<String> list = new ArrayList<>(map.keySet());
     // 遍历次数
     for (int j = 0; j < all / size; j++) {
             // Maps，Predicates 为 Google 的 guava 库中的类
             Map<String, Integer> subMap = Maps.filterKeys(map, Predicates.in(list.subList(j * size, (j + 1) * size)));
             res.add(subMap);
     }
     #+END_SRC
*** Web
