Tip.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Database</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Mysql</h4>
<div class="outline-text-4" id="text-1-3-1">
</div><ol class="org-ol"><li><a id="sec-1-3-1-1" name="sec-1-3-1-1"></a>查询 Mysql 数据库大小<br  /><div class="outline-text-5" id="text-1-3-1-1">
<ul class="org-ul">
<li>选择指定 <a href="http://dev.mysql.com/doc/refman/5.7/en/tables-table.html">information<sub>schema</sub> 数据库</a>
<div class="org-src-container">

<pre class="src src-sql">use information_schema;
</pre>
</div>
</li>
<li>查询整个数据库大小
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #66D9EF;">select</span> concat(round(<span style="color: #A6E22E;">sum</span>(DATA_LENGTH/1024/1024),2),<span style="color: #E6DB74;">'MB'</span>) <span style="color: #66D9EF;">as</span> <span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">from</span> TABLES;
</pre>
</div>
</li>
<li>查询指定数据库大小
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #66D9EF;">select</span> concat(round(<span style="color: #A6E22E;">sum</span>(DATA_LENGTH/1024/1024),2),<span style="color: #E6DB74;">'MB'</span>) <span style="color: #66D9EF;">as</span> <span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">from</span> TABLES <span style="color: #66D9EF;">where</span> table_schema=<span style="color: #E6DB74;">'your_database_name'</span>;
</pre>
</div>
</li>
<li>查询指定数据库下某个表的大小
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #66D9EF;">select</span> concat(round(<span style="color: #A6E22E;">sum</span>(DATA_LENGTH/1024/1024),2),<span style="color: #E6DB74;">'MB'</span>) <span style="color: #66D9EF;">as</span> <span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">from</span> TABLES <span style="color: #66D9EF;">where</span> table_schema=<span style="color: #E6DB74;">'your_database_name'</span> <span style="color: #66D9EF;">and</span> <span style="color: #66D9EF;">table_name</span>=<span style="color: #E6DB74;">'your_table_name'</span>;
</pre>
</div>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-3-1-2" name="sec-1-3-1-2"></a>Mysql 数据库存中文字符乱码解决方法<br  /><div class="outline-text-5" id="text-1-3-1-2">
<ul class="org-ul">
<li>修改 <a href="http://dev.mysql.com/doc/connector-j/5.1/en/connector-j-reference-configuration-properties.html">jdbc.url 配置</a>
<pre class="example">
jdbc.url=jdbc:mysql://ip-address:port/your_database_name?useUnicode=true&amp;characterEncoding=utf8
</pre>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-3-1-3" name="sec-1-3-1-3"></a>Mysql 新增用户, 并附指定权限<br  /><div class="outline-text-5" id="text-1-3-1-3">
<ul class="org-ul">
<li><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html">新增用户</a>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #66D9EF;">create</span> <span style="color: #A6E22E;">user</span> [<span style="color: #E6DB74;">'username'</span>]@[<span style="color: #E6DB74;">'localhost'</span>] identified <span style="color: #66D9EF;">by</span> [<span style="color: #E6DB74;">'password'</span>];
</pre>
</div>
</li>
<li><a href="http://dev.mysql.com/doc/refman/5.7/en/adding-users.html">附指定权限</a>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #66D9EF;">grant</span> <span style="color: #66D9EF;">all</span> <span style="color: #66D9EF;">privileges</span> <span style="color: #66D9EF;">on</span> [database].[<span style="color: #66D9EF;">table</span>] <span style="color: #66D9EF;">to</span> [<span style="color: #E6DB74;">'username'</span>]@[<span style="color: #E6DB74;">'localhost'</span>];
</pre>
</div>
</li>
<li><a href="http://dev.mysql.com/doc/refman/5.7/en/removing-users.html">删除用户</a>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #66D9EF;">drop</span> <span style="color: #A6E22E;">user</span> [<span style="color: #E6DB74;">'username'</span>]@[<span style="color: #E6DB74;">'localhost'</span>];
</pre>
</div>
</li>
</ul>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Java</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Java</h4>
<div class="outline-text-4" id="text-1-4-1">
</div><ol class="org-ol"><li><a id="sec-1-4-1-1" name="sec-1-4-1-1"></a>操作 jar 包<br  /><div class="outline-text-5" id="text-1-4-1-1">
<pre class="example">
- 查看 jar 包中的内容
  $ jar -tf *.jar
- 解压出 jar 包中的内容
  $ jar -xf *.jar
</pre>
</div>
</li>
<li><a id="sec-1-4-1-2" name="sec-1-4-1-2"></a>byte 数组与 int 互转<br  /><div class="outline-text-5" id="text-1-4-1-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b0c4de;">private</span> <span style="color: #66D9EF;">int</span> <span style="color: #F92672; font-style: italic;">byteArrayToInt</span>(<span style="color: #66D9EF;">byte</span>[] <span style="color: #F92672;">bytes</span>) {
    <span style="color: #66D9EF;">int</span> <span style="color: #F92672;">value</span> = <span style="color: #ffa07a;">0</span>;
    <span style="color: #66D9EF;">for</span> (<span style="color: #66D9EF;">int</span> <span style="color: #F92672;">i</span> = <span style="color: #ffa07a;">0</span>; i &lt; <span style="color: #ffa07a;">4</span>; i++) {
        <span style="color: #66D9EF;">int</span> <span style="color: #F92672;">shift</span> = (<span style="color: #ffa07a;">4</span> - <span style="color: #ffa07a;">1</span> - i) * <span style="color: #ffa07a;">8</span>;
        value += (bytes[i] &amp; <span style="color: #ffa07a;">0x000000FF</span>) &lt;&lt; shift;
    }
    <span style="color: #66D9EF;">return</span> value;
}

<span style="color: #b0c4de;">private</span> <span style="color: #66D9EF;">byte</span>[] <span style="color: #F92672; font-style: italic;">intToByteArray</span>(<span style="color: #66D9EF;">int</span> <span style="color: #F92672;">i</span>) {
    <span style="color: #66D9EF;">byte</span>[] <span style="color: #F92672;">result</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">byte</span>[<span style="color: #ffa07a;">4</span>];
    result[<span style="color: #ffa07a;">0</span>] = (<span style="color: #66D9EF;">byte</span>) ((i &gt;&gt; <span style="color: #ffa07a;">24</span>) &amp; <span style="color: #ffa07a;">0xFF</span>);
    result[<span style="color: #ffa07a;">1</span>] = (<span style="color: #66D9EF;">byte</span>) ((i &gt;&gt; <span style="color: #ffa07a;">16</span>) &amp; <span style="color: #ffa07a;">0xFF</span>);
    result[<span style="color: #ffa07a;">2</span>] = (<span style="color: #66D9EF;">byte</span>) ((i &gt;&gt; <span style="color: #ffa07a;">8</span>) &amp; <span style="color: #ffa07a;">0xFF</span>);
    result[<span style="color: #ffa07a;">3</span>] = (<span style="color: #66D9EF;">byte</span>) (i &amp; <span style="color: #ffa07a;">0xFF</span>);
    <span style="color: #66D9EF;">return</span> result;
}
</pre>
</div>
</div>
</li>
<li><a id="sec-1-4-1-3" name="sec-1-4-1-3"></a>倒序遍历 LinkedHashMap 集合<br  /><div class="outline-text-5" id="text-1-4-1-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #66D9EF;">Map</span>&lt;<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">String</span>&gt; <span style="color: #F92672;">data</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">LinkedHashMap</span>&lt;&gt;();
<span style="color: #66D9EF;">for</span> (<span style="color: #66D9EF;">int</span> <span style="color: #F92672;">i</span> = <span style="color: #ffa07a;">0</span>; i &lt; <span style="color: #ffa07a;">5</span>; i++) {
    data.put(i, <span style="color: #E6DB74;">"A"</span> + i);
}
<span style="color: #66D9EF;">ListIterator</span>&lt;<span style="color: #AE81FF;">Map</span>.<span style="color: #66D9EF;">Entry</span>&lt;<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">String</span>&gt;&gt; <span style="color: #F92672;">it</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">ArrayList</span>&lt;&gt;(data.entrySet()).listIterator(data.size());
<span style="color: #66D9EF;">while</span> (it.hasPrevious()) {
    <span style="color: #AE81FF;">Map</span>.<span style="color: #66D9EF;">Entry</span>&lt;<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">String</span>&gt; <span style="color: #F92672;">entry</span> = it.previous();
    System.out.println(<span style="color: #E6DB74;">"key : "</span> + entry.getKey() + <span style="color: #E6DB74;">" value : "</span> + entry.getValue());
}
</pre>
</div>
</div>
</li></ol>
</div>
