Tip.org
**** 前端页面传中文字符乱码解决方法
    - 修改 [[https://docs.oracle.com/cd/E14571_01/web.1111/e13712/web_xml.htm#WBAPP515][web.xml]] 文件, 添加 [[http://docs.spring.io/spring/docs/4.3.0.BUILD-SNAPSHOT/javadoc-api/org/springframework/web/filter/CharacterEncodingFilter.html][CharacterEncodingFilter]] 
      #+BEGIN_SRC xml
          <filter>
              <filter-name>CharacterEncodingFilter</filter-name>
              <filter-class>org.springframework.web.filter.CharacterEncodingFilter</filter-class>
              <init-param>
                  <param-name>encoding</param-name>
                  <param-value>UTF-8</param-value>
              </init-param>
              <init-param>
                  <param-name>forceEncoding</param-name>
                  <param-value>true</param-value>
              </init-param>
          </filter>

          <filter-mapping>
                <filter-name>CharacterEncodingFilter</filter-name>
                <url-pattern>/*</url-pattern>
          </filter-mapping>
      #+END_SRC
    - filter 需要放在所有 filter 的前面才会生效
**** 常见 ContentType 与文件后缀名对应关系
     | 文件扩展名        | ContentType                                                       |
     |------------------+-------------------------------------------------------------------|
     | .html            | text/html                                                         |
     | .doc             | application/msword                                                |
     | .ppt             | application/vnd.ms-powerpoint                                     |
     | .xls             | application/vnd.ms-excel                                          |
     | .xlsx            | application/vnd.openxmlformats-officedocument.spreadsheetml.sheet |
     | .xml             | text/xml                                                          |
     | .txt             | text/plain                                                        |
     | .pdf             | application/pdf                                                   |
     | .jpeg            | image/jpeg                                                        |
     | .js              | application/x-javascript                                          |
     | .css             | text/css                                                          |
     | .*(未知二进制流)  | application/octet-stream                                          |
     [[http://tool.oschina.net/commons][更多]]
*** Maven
**** Maven 基本操作
     #+BEGIN_SRC
     - 创建Maven的普通java项目
       $ mvn archetype:create -DgroupId=[packageName] -DartifactId=[projectName]
     - 创建Maven的Web项目
       $ mvn archetype:create -DgroupId=[packageName] -DartifactId=[webappName] -DarchetypeArtfactId=maven-archetype-webapp
     - 编译源码
       $ mvn compile
     - 打包
       $ mvn package
     - 在本地Repository中安装jar
       $ mvn install
     - 清理项目
       $ mvn clean
     - 生成eclipse/idea项目
       $ mvn eclipse:eclipse
       $ mvn idea:idea
     - 生成站点信息
       $ mvn site
     #+END_SRC
**** Maven 跳单元测试
    - 跳过单元测试
      #+BEGIN_SRC 
        $ mvn install -Dmaven.test.skip=true
      #+END_SRC
**** Maven 指定编译版本
    - 添加编译插件
      #+BEGIN_SRC xml
      <build>
        <plugins>
          <plugin>
            <groupId>org.apache.maven.plugins</groupId>
            <artifactId>maven-compiler-plugin</artifactId>
            <version>3.5.1</version>
            <configuration>  
              <source>1.X</source>  
              <target>1.X</target>  
              <encoding>UTF-8</encoding>  
            </configuration>  
          </plugin>
        </plugins>
      </build> 
      #+END_SRC
**** pom.xml 文件 - Missing artifact jdk.tools:jdk.tools:jar:1.x
     - pom 文件添加 tools 依赖
     #+BEGIN_SRC 
       <dependency>
			<groupId>jdk.tools</groupId>
			<artifactId>jdk.tools</artifactId>
			<version>1.x</version>
			<scope>system</scope>
    		<systemPath>${JAVA_HOME}/lib/tools.jar</systemPath>
	  </dependency>
     #+END_SRC
*** Tomcat
**** 导入 Web 项目，Tomcat 无法添加部署问题 - Tomcat version X.0 only supports J2EE 1.2, 1.3, 1.4, and Java EE X...
     - 其主要原因为当前 Tomcat 版本与该 Web 项目的Web版本不兼容，Tomcat 6支持 Web 2.5及以下版本，tomcat 7支持 Web 3.0及以下版本
     - 在 Eclipse 中：Project -> Properties -> Project Facets -> Dynamic Web Module，检查 Web 项目的Web版本
     1. Eclipse 环境下的修改方法为：项目根目录找到 .setting 文件夹中的 org.eclipse.wst.common.project.facet.core.xml 文件，修改其中 jst.web 的 version 的值至当前 Tomcat 支持的版本
     2. 更新 Tomcat 版本，使其与 Web 版本兼容
**** 配置从根目录访问 Tomcat 下的 Web 项目
     #+BEGIN_SRC xml
     <!-- docBase为webapp的路径 path为发布的路径，根目录访问这里留空  -->
     <!-- Context 标签配置在 Tomcat 目录下 conf 文件里的 Server.xml 配置文件中  -->
     <Server>
       <Service>
         <Engine>
           <Host>
             <Context docBase="[webapp_path]" path="" reloadable="true"/>
           </Host>
         </Engine>
       </Service>
     </Server>
     #+END_SRC
