Tip.html

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Web</h4>
<div class="outline-text-4" id="text-1-4-2">
</div><ol class="org-ol"><li><a id="sec-1-4-2-1" name="sec-1-4-2-1"></a>前端页面传中文字符乱码解决方法<br  /><div class="outline-text-5" id="text-1-4-2-1">
<ul class="org-ul">
<li>修改 <a href="https://docs.oracle.com/cd/E14571_01/web.1111/e13712/web_xml.htm#WBAPP515">web.xml</a> 文件, 添加 <a href="http://docs.spring.io/spring/docs/4.3.0.BUILD-SNAPSHOT/javadoc-api/org/springframework/web/filter/CharacterEncodingFilter.html">CharacterEncodingFilter</a> 
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #F92672; font-style: italic;">filter</span>&gt;
    &lt;<span style="color: #000000; background-color: #ff00ff; font-style: italic;">filter</span><span style="color: #F92672; font-style: italic;">-name</span>&gt;CharacterEncodingFilter&lt;/<span style="color: #F92672; font-style: italic;">filter-name</span>&gt;
    &lt;<span style="color: #F92672; font-style: italic;">filter-class</span>&gt;org.springframework.web.filter.CharacterEncodingFilter&lt;/<span style="color: #F92672; font-style: italic;">filter-class</span>&gt;
    &lt;<span style="color: #F92672; font-style: italic;">init-param</span>&gt;
        &lt;<span style="color: #000000; background-color: #ff00ff; font-style: italic;">param</span><span style="color: #F92672; font-style: italic;">-name</span>&gt;encoding&lt;/<span style="color: #F92672; font-style: italic;">param-name</span>&gt;
        &lt;<span style="color: #F92672; font-style: italic;">param-value</span>&gt;UTF-8&lt;/<span style="color: #F92672; font-style: italic;">param-value</span>&gt;
    &lt;/<span style="color: #F92672; font-style: italic;">init-param</span>&gt;
    &lt;<span style="color: #F92672; font-style: italic;">init-param</span>&gt;
        &lt;<span style="color: #000000; background-color: #ff00ff; font-style: italic;">param</span><span style="color: #F92672; font-style: italic;">-name</span>&gt;forceEncoding&lt;/<span style="color: #F92672; font-style: italic;">param-name</span>&gt;
        &lt;<span style="color: #F92672; font-style: italic;">param-value</span>&gt;true&lt;/<span style="color: #F92672; font-style: italic;">param-value</span>&gt;
    &lt;/<span style="color: #F92672; font-style: italic;">init-param</span>&gt;
&lt;/<span style="color: #F92672; font-style: italic;">filter</span>&gt;

&lt;<span style="color: #000000; background-color: #ff00ff; font-style: italic;">filter</span><span style="color: #F92672; font-style: italic;">-mapping</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">filter-name</span>&gt;CharacterEncodingFilter&lt;/<span style="color: #F92672; font-style: italic;">filter-name</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">url-pattern</span>&gt;/*&lt;/<span style="color: #F92672; font-style: italic;">url-pattern</span>&gt;
&lt;/<span style="color: #F92672; font-style: italic;">filter-mapping</span>&gt;
</pre>
</div>
</li>
<li>filter 需要放在所有 filter 的前面才会生效
</li>
</ul>
</div>
</li>
<li><a id="sec-1-4-2-2" name="sec-1-4-2-2"></a>常见 ContentType 与文件后缀名对应关系<br  /><div class="outline-text-5" id="text-1-4-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">文件扩展名</th>
<th scope="col" class="left">ContentType</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">.html</td>
<td class="left">text/html</td>
</tr>

<tr>
<td class="left">.doc</td>
<td class="left">application/msword</td>
</tr>

<tr>
<td class="left">.ppt</td>
<td class="left">application/vnd.ms-powerpoint</td>
</tr>

<tr>
<td class="left">.xls</td>
<td class="left">application/vnd.ms-excel</td>
</tr>

<tr>
<td class="left">.xlsx</td>
<td class="left">application/vnd.openxmlformats-officedocument.spreadsheetml.sheet</td>
</tr>

<tr>
<td class="left">.xml</td>
<td class="left">text/xml</td>
</tr>

<tr>
<td class="left">.txt</td>
<td class="left">text/plain</td>
</tr>

<tr>
<td class="left">.pdf</td>
<td class="left">application/pdf</td>
</tr>

<tr>
<td class="left">.jpeg</td>
<td class="left">image/jpeg</td>
</tr>

<tr>
<td class="left">.js</td>
<td class="left">application/x-javascript</td>
</tr>

<tr>
<td class="left">.css</td>
<td class="left">text/css</td>
</tr>

<tr>
<td class="left">.*(未知二进制流)</td>
<td class="left">application/octet-stream</td>
</tr>
</tbody>
</table>
<p>
<a href="http://tool.oschina.net/commons">更多</a>
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Maven</h4>
<div class="outline-text-4" id="text-1-4-3">
</div><ol class="org-ol"><li><a id="sec-1-4-3-1" name="sec-1-4-3-1"></a>Maven 基本操作<br  /><div class="outline-text-5" id="text-1-4-3-1">
<pre class="example">
- 创建Maven的普通java项目
  $ mvn archetype:create -DgroupId=[packageName] -DartifactId=[projectName]
- 创建Maven的Web项目
  $ mvn archetype:create -DgroupId=[packageName] -DartifactId=[webappName] -DarchetypeArtfactId=maven-archetype-webapp
- 编译源码
  $ mvn compile
- 打包
  $ mvn package
- 在本地Repository中安装jar
  $ mvn install
- 清理项目
  $ mvn clean
- 生成eclipse/idea项目
  $ mvn eclipse:eclipse
  $ mvn idea:idea
- 生成站点信息
  $ mvn site
</pre>
</div>
</li>
<li><a id="sec-1-4-3-2" name="sec-1-4-3-2"></a>Maven 跳单元测试<br  /><div class="outline-text-5" id="text-1-4-3-2">
<ul class="org-ul">
<li>跳过单元测试
<pre class="example">
$ mvn install -Dmaven.test.skip=true
</pre>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-4-3-3" name="sec-1-4-3-3"></a>Maven 指定编译版本<br  /><div class="outline-text-5" id="text-1-4-3-3">
<ul class="org-ul">
<li>添加编译插件
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #F92672; font-style: italic;">build</span>&gt;
  &lt;<span style="color: #F92672; font-style: italic;">plugins</span>&gt;
    &lt;<span style="color: #F92672; font-style: italic;">plugin</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">groupId</span>&gt;org.apache.maven.plugins&lt;/<span style="color: #F92672; font-style: italic;">groupId</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">artifactId</span>&gt;maven-compiler-plugin&lt;/<span style="color: #F92672; font-style: italic;">artifactId</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">version</span>&gt;3.5.1&lt;/<span style="color: #F92672; font-style: italic;">version</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">configuration</span>&gt;  
        &lt;<span style="color: #F92672; font-style: italic;">source</span>&gt;1.X&lt;/<span style="color: #F92672; font-style: italic;">source</span>&gt;  
        &lt;<span style="color: #F92672; font-style: italic;">target</span>&gt;1.X&lt;/<span style="color: #F92672; font-style: italic;">target</span>&gt;  
        &lt;<span style="color: #F92672; font-style: italic;">encoding</span>&gt;UTF-8&lt;/<span style="color: #F92672; font-style: italic;">encoding</span>&gt;  
      &lt;/<span style="color: #F92672; font-style: italic;">configuration</span>&gt;  
    &lt;/<span style="color: #F92672; font-style: italic;">plugin</span>&gt;
  &lt;/<span style="color: #F92672; font-style: italic;">plugins</span>&gt;
&lt;/<span style="color: #F92672; font-style: italic;">build</span>&gt;
</pre>
</div>
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> Tomcat</h4>
<div class="outline-text-4" id="text-1-4-4">
</div><ol class="org-ol"><li><a id="sec-1-4-4-1" name="sec-1-4-4-1"></a>导入 Web 项目，Tomcat 无法添加部署问题 - Tomcat version X.0 only supports J2EE 1.2, 1.3, 1.4, and Java EE X&#x2026;<br  /><div class="outline-text-5" id="text-1-4-4-1">
<ul class="org-ul">
<li>其主要原因为当前 Tomcat 版本与该 Web 项目的Web版本不兼容，Tomcat 6支持 Web 2.5及以下版本，tomcat 7支持 Web 3.0及以下版本
</li>
<li>在 Eclipse 中：Project -&gt; Properties -&gt; Project Facets -&gt; Dynamic Web Module，检查 Web 项目的Web版本
</li>
<li>Eclipse 环境下的修改方法为：项目根目录找到 .setting 文件夹中的 org.eclipse.wst.common.project.facet.core.xml 文件，修改其中 jst.web 的 version 的值至当前 Tomcat 支持的版本
</li>
<li>更新 Tomcat 版本，使其与 Web 版本兼容
</li>
</ul>
</div>
</li>
<li><a id="sec-1-4-4-2" name="sec-1-4-4-2"></a>配置从根目录访问 Tomcat 下的 Web 项目<br  /><div class="outline-text-5" id="text-1-4-4-2">
<div class="org-src-container">

<pre class="src src-xml"><span style="color: #465457; font-style: italic;">&lt;!--</span><span style="color: #465457; font-style: italic;"> docBase&#20026;webapp&#30340;&#36335;&#24452; path&#20026;&#21457;&#24067;&#30340;&#36335;&#24452;&#65292;&#26681;&#30446;&#24405;&#35775;&#38382;&#36825;&#37324;&#30041;&#31354;  </span><span style="color: #465457; font-style: italic;">--&gt;</span>
<span style="color: #465457; font-style: italic;">&lt;!--</span><span style="color: #465457; font-style: italic;"> Context &#26631;&#31614;&#37197;&#32622;&#22312; Tomcat &#30446;&#24405;&#19979; conf &#25991;&#20214;&#37324;&#30340; Server.xml &#37197;&#32622;&#25991;&#20214;&#20013;  </span><span style="color: #465457; font-style: italic;">--&gt;</span>
&lt;<span style="color: #F92672; font-style: italic;">Server</span>&gt;
  &lt;<span style="color: #F92672; font-style: italic;">Service</span>&gt;
    &lt;<span style="color: #F92672; font-style: italic;">Engine</span>&gt;
      &lt;<span style="color: #F92672; font-style: italic;">Host</span>&gt;
        &lt;<span style="color: #F92672; font-style: italic;">Context</span> <span style="color: #F92672;">docBase</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">[webapp_path]</span><span style="color: #E6DB74;">"</span> <span style="color: #000000; background-color: #ff00ff;">path</span>=<span style="color: #E6DB74;">""</span> <span style="color: #F92672;">reloadable</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">true</span><span style="color: #E6DB74;">"</span>/&gt;
      &lt;/<span style="color: #F92672; font-style: italic;">Host</span>&gt;
    &lt;/<span style="color: #F92672; font-style: italic;">Engine</span>&gt;
  &lt;/<span style="color: #F92672; font-style: italic;">Service</span>&gt;
&lt;/<span style="color: #F92672; font-style: italic;">Server</span>&gt;
</pre>
</div>
</div>
</li>
