Tip.org
**** eclipse 中 Web 项目配置根目录访问
     - 修改 Web 项目的 Context Path
     1. 打开 web project folder >> .setting >> org.eclipse.wst.common.component 文件
     2. 编辑该文件，修改其中 content-root 属性为空值
     #+BEGIN_SRC xml
     <project-modules id="moduleCoreId" project-version="1.5.0">
         <wb-module deploy-name="webapp">
             ...
             <property name="context-root" value=""/>
         </wb-module>
     </project-modules>
     #+END_SRC
*** JNI
**** 使用 javah 生成头文件问题 - Error: Could not find class file for "X"
     #+BEGIN_SRC
     - HelloWorld.class 在 net.saisimon.jni 包中
       $ javah HelloWorld
       Error: Could not find class file for 'HelloWorld'.
     - HelloWorld 在 Java 包中，需要到包的根目录执行 javah 命令
       $ cd ../../../
       $ javah net.saisimon.jni.HelloWorld
     - 即可生成头文件 net_saisimon_jni_HelloWorld.h
     #+END_SRC
*** 多线程
**** 统计所有线程消耗的总时间
     #+BEGIN_SRC java
     package net.saisimon.test

     import java.util.concurrent.CountDownLatch;
     import java.util.concurrent.ExecutorService;
     import java.util.concurrent.Executors;

     import org.apache.commons.codec.digest.DigestUtils;

     public class Test implements Runnable {
         
         volatile int vote = 0;
         CountDownLatch cdl = new CountDownLatch(5);
             
         @Override
         public void run() {
             parse();
             // 递减计数器
             cdl.countDown();
         }

         public void parse() {
             while (vote < 10) {
                 int x = 0;
                 int v = vote;
                 vote++;
                 String tmp = "Saisimon" + v + x;
                 String md5 = DigestUtils.md5Hex(tmp);
                 while (!md5.startsWith("000000")) {
                     x++;
                     tmp = "Saisimon" + v + x;
                     md5 = DigestUtils.md5Hex(tmp);
                 }
                 System.out.println("thread : " + Thread.currentThread().getName() + " , vote : " + v + " , x : " + x);
             }
         }

         public static void main(String[] args) {
             Test t = new Test();
             long start = System.currentTimeMillis();
             ExecutorService es = Executors.newFixedThreadPool(5);
             for (int i = 0; i < 5; i++) {
                 es.execute(t);
             }
             es.shutdown();
             try {
                 // 计数器减至零时，await 会被执行
                 p.cdl.await();
             } catch (InterruptedException e) {
                 e.printStackTrace();
             }
             System.out.println("多线程耗时:" + (System.currentTimeMillis() - start));
         }
     }
     #+END_SRC
*** Solr
**** Solr 导入 csv 文件数据
     #+BEGIN_SRC 
       http://localhost:8983/solr/item/update?commit=true&stream.file=d:/tmp/solr_data.csv&stream.contentType=application/csv
     #+END_SRC
*** Eclipse
**** 显示 Eclipse 内存堆占用条，手动 GC
     - 修改配置文件 {workspaceHome}/.metadata/.plugins/org.eclipse.core.runtime/.settings/org.eclipse.ui.prefs 
     #+BEGIN_SRC 
       SHOW_MEMORY_MONITOR=true
     #+END_SRC
** Python
*** SCons
**** CentOS 下编译安装 SCons
     #+BEGIN_SRC
     - 确定系统中安装了 Python
       $ python -V
       Python 2.6.6
     - 方式一: 使用 yum 安装 SCons
       $ yum install scons
     - 方式二: 使用安装包安装 SCons
       - 去官网下载 SCons 安装包，解压
       $ tar -xzvf scons-2.4.1.tar.gz
       - 编译安装，默认安装路径 /usr/lib/scons-2.4.1
       $ python setup.py install [--prefix=/xx/xx]
     - 查看版本号
       $ scons -v
     #+END_SRC

** JavaScript
*** JavaScript
**** JavaScript 类型判断
    - 是否为数字
      #+BEGIN_SRC javascript
      function isNumber(obj) {
          return obj === +obj;
      }
      #+END_SRC
    - 是否为字符串
      #+BEGIN_SRC javascript
      function isString(obj) {
          return obj === obj + '';
      }
      #+END_SRC
    - 是否为布尔类型
      #+BEGIN_SRC javascript
      function isBoolean(obj) {
          return obj === !!obj;
      }
      #+END_SRC
**** JavaScript 首字母大写
     #+BEGIN_SRC javascript
     function toCapitalizeCase(str) {
         if (!str || str.length === 0) {
             return str;
         }
         if (str.length == 1) {
             return str.toUpperCase();
         } else {
             return str[0].toUpperCase() + str.substring(1);
         }
     }
     #+END_SRC
*** JQuery
