Tip.html
<li><a id="sec-1-4-4-3" name="sec-1-4-4-3"></a>eclipse 中 Web 项目配置根目录访问<br  /><div class="outline-text-5" id="text-1-4-4-3">
<ul class="org-ul">
<li>修改 Web 项目的 Context Path
</li>
<li>打开 web project folder &gt;&gt; .setting &gt;&gt; org.eclipse.wst.common.component 文件
</li>
<li>编辑该文件，修改其中 content-root 属性为空值
</li>
</ul>
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #F92672; font-style: italic;">project-modules</span> <span style="color: #F92672;">id</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">moduleCoreId</span><span style="color: #E6DB74;">"</span> <span style="color: #F92672;">project-version</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">1.5.0</span><span style="color: #E6DB74;">"</span>&gt;
    &lt;<span style="color: #F92672; font-style: italic;">wb-module</span> <span style="color: #F92672;">deploy-name</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">webapp</span><span style="color: #E6DB74;">"</span>&gt;
        ...
        &lt;<span style="color: #F92672; font-style: italic;">property</span> <span style="color: #F92672;">name</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">context-root</span><span style="color: #E6DB74;">"</span> <span style="color: #F92672;">value</span>=<span style="color: #E6DB74;">""</span>/&gt;
    &lt;/<span style="color: #F92672; font-style: italic;">wb-module</span>&gt;
&lt;/<span style="color: #F92672; font-style: italic;">project-modules</span>&gt;
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> JNI</h4>
<div class="outline-text-4" id="text-1-4-5">
</div><ol class="org-ol"><li><a id="sec-1-4-5-1" name="sec-1-4-5-1"></a>使用 javah 生成头文件问题 - Error: Could not find class file for "X"<br  /><div class="outline-text-5" id="text-1-4-5-1">
<pre class="example">
- HelloWorld.class 在 net.saisimon.jni 包中
  $ javah HelloWorld
  Error: Could not find class file for 'HelloWorld'.
- HelloWorld 在 Java 包中，需要到包的根目录执行 javah 命令
  $ cd ../../../
  $ javah net.saisimon.jni.HelloWorld
- 即可生成头文件 net_saisimon_jni_HelloWorld.h
</pre>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> 多线程</h4>
<div class="outline-text-4" id="text-1-4-6">
</div><ol class="org-ol"><li><a id="sec-1-4-6-1" name="sec-1-4-6-1"></a>统计所有线程消耗的总时间<br  /><div class="outline-text-5" id="text-1-4-6-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #66D9EF;">package</span> <span style="color: #63b8ff;">net.saisimon.test</span>

<span style="color: #66D9EF;">import</span> <span style="color: #63b8ff;">java.util.concurrent.</span><span style="color: #66D9EF;">CountDownLatch</span>;
<span style="color: #66D9EF;">import</span> <span style="color: #63b8ff;">java.util.concurrent.</span><span style="color: #66D9EF;">ExecutorService</span>;
<span style="color: #66D9EF;">import</span> <span style="color: #63b8ff;">java.util.concurrent.</span><span style="color: #66D9EF;">Executors</span>;

<span style="color: #66D9EF;">import</span> <span style="color: #63b8ff;">org.apache.commons.codec.digest.</span><span style="color: #66D9EF;">DigestUtils</span>;

<span style="color: #b0c4de;">public</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">Test</span> <span style="color: #66D9EF;">implements</span> <span style="color: #66D9EF;">Runnable</span> {

    <span style="color: #b0c4de;">volatile</span> <span style="color: #66D9EF;">int</span> <span style="color: #F92672;">vote</span> = <span style="color: #ffa07a;">0</span>;
    <span style="color: #66D9EF;">CountDownLatch</span> <span style="color: #F92672;">cdl</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">CountDownLatch</span>(<span style="color: #ffa07a;">5</span>);

    <span style="color: #AE81FF;">@Override</span>
    <span style="color: #b0c4de;">public</span> <span style="color: #66D9EF;">void</span> <span style="color: #F92672; font-style: italic;">run</span>() {
        parse();
        <span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">&#36882;&#20943;&#35745;&#25968;&#22120;</span>
        cdl.countDown();
    }

    <span style="color: #b0c4de;">public</span> <span style="color: #66D9EF;">void</span> <span style="color: #F92672; font-style: italic;">parse</span>() {
        <span style="color: #66D9EF;">while</span> (vote &lt; <span style="color: #ffa07a;">10</span>) {
            <span style="color: #66D9EF;">int</span> <span style="color: #F92672;">x</span> = <span style="color: #ffa07a;">0</span>;
            <span style="color: #66D9EF;">int</span> <span style="color: #F92672;">v</span> = vote;
            vote++;
            <span style="color: #66D9EF;">String</span> <span style="color: #F92672;">tmp</span> = <span style="color: #E6DB74;">"Saisimon"</span> + v + x;
            <span style="color: #66D9EF;">String</span> <span style="color: #F92672;">md5</span> = DigestUtils.md5Hex(tmp);
            <span style="color: #66D9EF;">while</span> (<span style="font-weight: bold;">!</span>md5.startsWith(<span style="color: #E6DB74;">"000000"</span>)) {
                x++;
                tmp = <span style="color: #E6DB74;">"Saisimon"</span> + v + x;
                md5 = DigestUtils.md5Hex(tmp);
            }
            System.out.println(<span style="color: #E6DB74;">"thread : "</span> + Thread.currentThread().getName() + <span style="color: #E6DB74;">" , vote : "</span> + v + <span style="color: #E6DB74;">" , x : "</span> + x);
        }
    }

    <span style="color: #b0c4de;">public</span> <span style="color: #b0c4de;">static</span> <span style="color: #66D9EF;">void</span> <span style="color: #F92672; font-style: italic;">main</span>(<span style="color: #66D9EF;">String</span>[] <span style="color: #F92672;">args</span>) {
        <span style="color: #66D9EF;">Test</span> <span style="color: #F92672;">t</span> = <span style="color: #66D9EF;">new</span> <span style="color: #66D9EF;">Test</span>();
        <span style="color: #66D9EF;">long</span> <span style="color: #F92672;">start</span> = System.currentTimeMillis();
        <span style="color: #66D9EF;">ExecutorService</span> <span style="color: #F92672;">es</span> = Executors.newFixedThreadPool(<span style="color: #ffa07a;">5</span>);
        <span style="color: #66D9EF;">for</span> (<span style="color: #66D9EF;">int</span> <span style="color: #F92672;">i</span> = <span style="color: #ffa07a;">0</span>; i &lt; <span style="color: #ffa07a;">5</span>; i++) {
            es.execute(t);
        }
        es.shutdown();
        <span style="color: #66D9EF;">try</span> {
            <span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">&#35745;&#25968;&#22120;&#20943;&#33267;&#38646;&#26102;&#65292;await &#20250;&#34987;&#25191;&#34892;</span>
            p.cdl.await();
        } <span style="color: #66D9EF;">catch</span> (<span style="color: #66D9EF;">InterruptedException</span> <span style="color: #F92672;">e</span>) {
            e.printStackTrace();
        }
        System.out.println(<span style="color: #E6DB74;">"&#22810;&#32447;&#31243;&#32791;&#26102;:"</span> + (System.currentTimeMillis() - start));
    }
}
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> Solr</h4>
<div class="outline-text-4" id="text-1-4-7">
</div><ol class="org-ol"><li><a id="sec-1-4-7-1" name="sec-1-4-7-1"></a>Solr 导入 csv 文件数据<br  /><div class="outline-text-5" id="text-1-4-7-1">
<pre class="example">
http://localhost:8983/solr/item/update?commit=true&amp;stream.file=d:/tmp/solr_data.csv&amp;stream.contentType=application/csv
</pre>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-8" class="outline-4">
<h4 id="sec-1-4-8"><span class="section-number-4">1.4.8</span> Eclipse</h4>
<div class="outline-text-4" id="text-1-4-8">
</div><ol class="org-ol"><li><a id="sec-1-4-8-1" name="sec-1-4-8-1"></a>显示 Eclipse 内存堆占用条，手动 GC<br  /><div class="outline-text-5" id="text-1-4-8-1">
<ul class="org-ul">
<li>修改配置文件 {workspaceHome}/.metadata/.plugins/org.eclipse.core.runtime/.settings/org.eclipse.ui.prefs 
</li>
</ul>
<pre class="example">
SHOW_MEMORY_MONITOR=true
</pre>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Python</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> SCons</h4>
<div class="outline-text-4" id="text-1-5-1">
</div><ol class="org-ol"><li><a id="sec-1-5-1-1" name="sec-1-5-1-1"></a>CentOS 下编译安装 SCons<br  /><div class="outline-text-5" id="text-1-5-1-1">
<pre class="example">
- 确定系统中安装了 Python
  $ python -V
  Python 2.6.6
- 方式一: 使用 yum 安装 SCons
  $ yum install scons
- 方式二: 使用安装包安装 SCons
  - 去官网下载 SCons 安装包，解压
  $ tar -xzvf scons-2.4.1.tar.gz
  - 编译安装，默认安装路径 /usr/lib/scons-2.4.1
  $ python setup.py install [--prefix=/xx/xx]
- 查看版本号
  $ scons -v
</pre>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> JavaScript</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> JavaScript</h4>
<div class="outline-text-4" id="text-1-6-1">
</div><ol class="org-ol"><li><a id="sec-1-6-1-1" name="sec-1-6-1-1"></a>JavaScript 类型判断<br  /><div class="outline-text-5" id="text-1-6-1-1">
<ul class="org-ul">
<li>是否为数字
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #66D9EF;">function</span> <span style="color: #F92672; font-style: italic;">isNumber</span>(<span style="color: #F92672;">obj</span>) {
    <span style="color: #66D9EF;">return</span> obj === +obj;
}
</pre>
</div>
</li>
<li>是否为字符串
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #66D9EF;">function</span> <span style="color: #F92672; font-style: italic;">isString</span>(<span style="color: #F92672;">obj</span>) {
    <span style="color: #66D9EF;">return</span> obj === obj + <span style="color: #E6DB74;">''</span>;
}
</pre>
</div>
</li>
<li>是否为布尔类型
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #66D9EF;">function</span> <span style="color: #F92672; font-style: italic;">isBoolean</span>(<span style="color: #F92672;">obj</span>) {
    <span style="color: #66D9EF;">return</span> obj === !!obj;
}
</pre>
</div>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-6-1-2" name="sec-1-6-1-2"></a>JavaScript 首字母大写<br  /><div class="outline-text-5" id="text-1-6-1-2">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #66D9EF;">function</span> <span style="color: #F92672; font-style: italic;">toCapitalizeCase</span>(<span style="color: #F92672;">str</span>) {
    <span style="color: #66D9EF;">if</span> (!str || str.length === 0) {
        <span style="color: #66D9EF;">return</span> str;
    }
    <span style="color: #66D9EF;">if</span> (str.length == 1) {
        <span style="color: #66D9EF;">return</span> str.toUpperCase();
    } <span style="color: #66D9EF;">else</span> {
        <span style="color: #66D9EF;">return</span> str[0].toUpperCase() + str.substring(1);
    }
}
</pre>
</div>
</div>
</li></ol>
</div>
