Tip.org
**** JQuery 与 Prototype 中 $ 符号冲突解决方法
    - JQuery 在 prototype 之后引入，即：
      #+BEGIN_SRC xml
      <script src="prototype.js" type="text/javascript"/> 
      <script src="jquery.js" type="text/javascript"/>
      #+END_SRC
      #+BEGIN_SRC javascript
      // 改变 JQuery 的选择标识符，将 $ 的控制权交还给 Prototype 。
      var jq = JQuery.noConflict();
      // 使用 JQuery 选择器的方式改为如下：
      jq("#id").text();
      #+END_SRC
    - JQuery 在 prototype 之前引入，即：
      #+BEGIN_SRC xml
      <script src="jquery.js" type="text/javascript"/> 
      <script src="prototype.js" type="text/javascript"/>
      #+END_SRC
      #+BEGIN_SRC javascript
      // 这种情况 $ 为 Prototype 中定义的标识符，要想使用 JQuery 的选择器，需用如下形式：
      JQuery("#id").text();
      #+END_SRC
    - 通用解决方案，不管引入的先后顺序：
      #+BEGIN_SRC javascript
      // JQuery 放弃 $ 所有权
      JQuery.noConflict();
      (function($){ 
              .....
              //此时在这个语句块中使用的都是 JQuery 中定义的 $
              $('#id').text(); 
      })(JQuery)
      #+END_SRC

**** JQuery 获取 url 参数
    #+BEGIN_SRC javascript
    $.extend({
        getUrlVars: function(){
            var vars = [], hash;
            var hashes = window.location.href.slice(window.location.href.indexOf('?') + 1).split('&');
            for(var i = 0; i < hashes.length; i++) {
                hash = hashes[i].split('=');
                vars.push(hash[0]);
                vars[hash[0]] = hash[1];
            }
            return vars;
        },
        getUrlVar: function(name){
            return $.getUrlVars()[name];
        }
    });

    // 调用方法
    $(document).ready(function() {
        var args = $.getUrlVars();
        var arg1 = $.getUrlVar('argName1');
        var arg2 = $.getUrlVar('argName2');
    });
    #+END_SRC
*** Prototype
**** Prototype 获取 select 选择框中选中文本
     #+BEGIN_SRC javascript
     // 选择框中选中文本的下标
     var idx = $(id).selectedIndex;
     // 获取文本
     var text = $(id).options[idx].text.strip();
     #+END_SRC

** Emacs
*** 安装 Emacs 时，error: The required function `tputs' was not found in any library
    - 缺少 libncurses-dev 包
    #+BEGIN_SRC 
    $ yum install libncurses-dev -y
    或
    $ apt-get install libncurses-dev
    #+END_SRC
   
** Git
*** Git 基本操作
    #+BEGIN_SRC 
    - 初始化
      $ git init
    - clone别人的库
      $ git clone ssh://user@domain.com/repo.git
    - 查看库的状态
      $ git status
    - 查看工作区与暂存区文件的修改
      $ git diff
    - 添加文件到暂存区
      $ git add .
    - 提交文件到本地库
      $ git commit
    - 提交历史纪录
      $ git log
    - 查看库的分支
      $ git branch
    - 切换分支
      $ git checkout <branch>
    - 将本地库推送至远程库中
      $ git push <remote> <branch>
    - 将指定分支合并至当前分支
      $ git merge <branch>
    #+END_SRC
*** 更新 .gitignore 后，清理 Git 仓库
    #+BEGIN_SRC 
    - 清理暂存区的文件
      $ git rm -r --cached .
    - 添加所有文件
      $ git add .
    - 提交
      $ git commit -m ".gitignore is now working"
    #+END_SRC
*** Git 在 push 之前撤回最近一次 commit 命令
    #+BEGIN_SRC 
      $ git reset --soft HEAD^
    #+END_SRC
*** 修改 Git 别名
    - 修改 .gitconfig 文件中[alias]属性
       #+BEGIN_SRC 
         $ vi ~/.gitconfig
           [alias]
               st = status
               ci = commit
               co = checkout
               br = branch
       #+END_SRC
    - 使用 git config --global alias.[alias-name] [operation-name]
       #+BEGIN_SRC 
         # 表示将 st 作为 status 的别名，可以直接使用 git st 命令
         $ git config --global alias.st status
       #+END_SRC
*** Git 推送代码
    #+BEGIN_SRC
    - 首次推送，添加远程代码库至配置
      $ git remote add tip https://github.com/Saisimon/tip.git
    - 推送代码至远程代码库
      $ git push tip master
    - 输入账号密码进行确认
    #+END_SRC
*** Git 拉取代码
    #+BEGIN_SRC
    - 暂存工作区
     $ git stash
    - 拉取远程代码
     $ git pull origin master
    - 还原最近一次工作区的内容
     $ git stash pop
    - 出现冲突时，解决冲突提交即可
    #+END_SRC
*** 添加新 ssh_key 至 Github
    #+BEGIN_SRC
    - 检查是否存在 .ssh 文件夹
      $ cd ~/.ssh
    - 生成 ssh_key
      $ ssh-keygen -t rsa -C "youremail@email.com"
    - 输入密码
    - 启动 ssh-agent
      $ eval "$(ssh-agent -s)"
    - 添加 ssh_key 到 ssh-agent
      $ ssh-add ~/.ssh/id_rsa
    - 将 id_rsa.pub 中的key添加进 Github 中
      github >> Settings >> SSH and GPG keys >> new SSH key
    - 测试联通性
      $ ssh git@github.com
      Hi Saisimon! You've successfully authenticated, but GitHub does not provide shell access.
      Connection to github.com closed.
    #+END_SRC
*** Git status 输出中文为 UNICODE 解决方法
    - 修改 git config 属性
      #+BEGIN_SRC
        $ git config --global core.quotepath false
      #+END_SRC
    - 修改修改 git 配置文件
      #+BEGIN_SRC
        $ vi ~/.gitconfig
          [core]
              quotepath = false
      #+END_SRC
*** Git push 时，fatal: Authentication failed
    - 修改 remote 地址
      #+BEGIN_SRC
         $ git remote set-url origin <ssh url>
      #+END_SRC