Tip.html
<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> JQuery</h4>
<div class="outline-text-4" id="text-1-6-2">
</div><ol class="org-ol"><li><a id="sec-1-6-2-1" name="sec-1-6-2-1"></a>JQuery 与 Prototype 中 $ 符号冲突解决方法<br  /><div class="outline-text-5" id="text-1-6-2-1">
<ul class="org-ul">
<li>JQuery 在 prototype 之后引入，即：
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #F92672; font-style: italic;">script</span> <span style="color: #F92672;">src</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">prototype.js</span><span style="color: #E6DB74;">"</span> <span style="color: #F92672;">type</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">text/javascript</span><span style="color: #E6DB74;">"</span>/&gt; 
&lt;<span style="color: #F92672; font-style: italic;">script</span> <span style="color: #F92672;">src</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">jquery.js</span><span style="color: #E6DB74;">"</span> <span style="color: #F92672;">type</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">text/javascript</span><span style="color: #E6DB74;">"</span>/&gt;
</pre>
</div>
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">&#25913;&#21464; JQuery &#30340;&#36873;&#25321;&#26631;&#35782;&#31526;&#65292;&#23558; $ &#30340;&#25511;&#21046;&#26435;&#20132;&#36824;&#32473; Prototype &#12290;</span>
<span style="color: #66D9EF;">var</span> <span style="color: #F92672;">jq</span> = JQuery.noConflict();
<span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">&#20351;&#29992; JQuery &#36873;&#25321;&#22120;&#30340;&#26041;&#24335;&#25913;&#20026;&#22914;&#19979;&#65306;</span>
jq(<span style="color: #E6DB74;">"#id"</span>).text();
</pre>
</div>
</li>
<li>JQuery 在 prototype 之前引入，即：
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #F92672; font-style: italic;">script</span> <span style="color: #F92672;">src</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">jquery.js</span><span style="color: #E6DB74;">"</span> <span style="color: #F92672;">type</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">text/javascript</span><span style="color: #E6DB74;">"</span>/&gt; 
&lt;<span style="color: #F92672; font-style: italic;">script</span> <span style="color: #F92672;">src</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">prototype.js</span><span style="color: #E6DB74;">"</span> <span style="color: #F92672;">type</span>=<span style="color: #E6DB74;">"</span><span style="color: #E6DB74;">text/javascript</span><span style="color: #E6DB74;">"</span>/&gt;
</pre>
</div>
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">&#36825;&#31181;&#24773;&#20917; $ &#20026; Prototype &#20013;&#23450;&#20041;&#30340;&#26631;&#35782;&#31526;&#65292;&#35201;&#24819;&#20351;&#29992; JQuery &#30340;&#36873;&#25321;&#22120;&#65292;&#38656;&#29992;&#22914;&#19979;&#24418;&#24335;&#65306;</span>
JQuery(<span style="color: #E6DB74;">"#id"</span>).text();
</pre>
</div>
</li>
<li>通用解决方案，不管引入的先后顺序：
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">JQuery &#25918;&#24323; $ &#25152;&#26377;&#26435;</span>
JQuery.noConflict();
(<span style="color: #66D9EF;">function</span>(<span style="color: #F92672;">$</span>){ 
        .....
        <span style="color: #465457; font-style: italic;">//</span><span style="color: #465457; font-style: italic;">&#27492;&#26102;&#22312;&#36825;&#20010;&#35821;&#21477;&#22359;&#20013;&#20351;&#29992;&#30340;&#37117;&#26159; JQuery &#20013;&#23450;&#20041;&#30340; $</span>
        $(<span style="color: #E6DB74;">'#id'</span>).text(); 
})(JQuery)
</pre>
</div>
</li>
</ul>
</div>
</li>

<li><a id="sec-1-6-2-2" name="sec-1-6-2-2"></a>JQuery 获取 url 参数<br  /><div class="outline-text-5" id="text-1-6-2-2">
<div class="org-src-container">

<pre class="src src-javascript">$.extend({
    <span style="color: #F92672; font-style: italic;">getUrlVars</span>: <span style="color: #66D9EF;">function</span>(){
        <span style="color: #66D9EF;">var</span> <span style="color: #F92672;">vars</span> = [], <span style="color: #F92672;">hash</span>;
        <span style="color: #66D9EF;">var</span> <span style="color: #F92672;">hashes</span> = window.location.href.slice(window.location.href.indexOf(<span style="color: #E6DB74;">'?'</span>) + 1).split(<span style="color: #E6DB74;">'&amp;'</span>);
        <span style="color: #66D9EF;">for</span>(<span style="color: #66D9EF;">var</span> <span style="color: #F92672;">i</span> = 0; i &lt; hashes.length; i++) {
            hash = hashes[i].split(<span style="color: #E6DB74;">'='</span>);
            vars.push(hash[0]);
            vars[hash[0]] = hash[1];
        }
        <span style="color: #66D9EF;">return</span> vars;
    },
    <span style="color: #F92672; font-style: italic;">getUrlVar</span>: <span style="color: #66D9EF;">function</span>(<span style="color: #F92672;">name</span>){
        <span style="color: #66D9EF;">return</span> $.getUrlVars()[name];
    }
});

<span style="color: #465457; font-style: italic;">// </span><span style="color: #465457; font-style: italic;">&#35843;&#29992;&#26041;&#27861;</span>
$(document).ready(<span style="color: #66D9EF;">function</span>() {
    <span style="color: #66D9EF;">var</span> <span style="color: #F92672;">args</span> = $.getUrlVars();
    <span style="color: #66D9EF;">var</span> <span style="color: #F92672;">arg1</span> = $.getUrlVar(<span style="color: #E6DB74;">'argName1'</span>);
    <span style="color: #66D9EF;">var</span> <span style="color: #F92672;">arg2</span> = $.getUrlVar(<span style="color: #E6DB74;">'argName2'</span>);
});
</pre>
</div>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Emacs</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> 安装 Emacs 时，error: The required function `tputs' was not found in any library</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li>缺少 libncurses-dev 包
</li>
</ul>
<pre class="example">
$ yum install libncurses-dev -y
或
$ apt-get install libncurses-dev
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Git</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> Git 基本操作</h4>
<div class="outline-text-4" id="text-1-8-1">
<pre class="example">
- 初始化
  $ git init
- clone别人的库
  $ git clone ssh://user@domain.com/repo.git
- 查看库的状态
  $ git status
- 查看工作区与暂存区文件的修改
  $ git diff
- 添加文件到暂存区
  $ git add .
- 提交文件到本地库
  $ git commit
- 提交历史纪录
  $ git log
- 查看库的分支
  $ git branch
- 切换分支
  $ git checkout &lt;branch&gt;
- 将本地库推送至远程库中
  $ git push &lt;remote&gt; &lt;branch&gt;
- 将指定分支合并至当前分支
  $ git merge &lt;branch&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-1-8-2" class="outline-4">
<h4 id="sec-1-8-2"><span class="section-number-4">1.8.2</span> 更新 .gitignore 后，清理 Git 仓库</h4>
<div class="outline-text-4" id="text-1-8-2">
<pre class="example">
- 清理暂存区的文件
  $ git rm -r --cached .
- 添加所有文件
  $ git add .
- 提交
  $ git commit -m ".gitignore is now working"
</pre>
</div>
</div>
<div id="outline-container-sec-1-8-3" class="outline-4">
<h4 id="sec-1-8-3"><span class="section-number-4">1.8.3</span> Git 在 push 之前撤回最近一次 commit 命令</h4>
<div class="outline-text-4" id="text-1-8-3">
<pre class="example">
$ git reset --soft HEAD^
</pre>
</div>
</div>
<div id="outline-container-sec-1-8-4" class="outline-4">
<h4 id="sec-1-8-4"><span class="section-number-4">1.8.4</span> 修改 Git 别名</h4>
<div class="outline-text-4" id="text-1-8-4">
<ul class="org-ul">
<li>修改 .gitconfig 文件中[alias]属性
<pre class="example">
$ vi ~/.gitconfig
  [alias]
      st = status
      ci = commit
      co = checkout
      br = branch
</pre>
</li>
<li>使用 git config &#x2013;global alias.[alias-name] [operation-name]
<pre class="example">
# 表示将 st 作为 status 的别名，可以直接使用 git st 命令
$ git config --global alias.st status
</pre>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-8-5" class="outline-4">
<h4 id="sec-1-8-5"><span class="section-number-4">1.8.5</span> Git 推送代码</h4>
<div class="outline-text-4" id="text-1-8-5">
<pre class="example">
- 首次推送，添加远程代码库至配置
  $ git remote add tip https://github.com/Saisimon/tip.git
- 推送代码至远程代码库
  $ git push tip master
- 输入账号密码进行确认
</pre>
</div>
</div>
<div id="outline-container-sec-1-8-6" class="outline-4">
<h4 id="sec-1-8-6"><span class="section-number-4">1.8.6</span> Git 拉取代码</h4>
<div class="outline-text-4" id="text-1-8-6">
<pre class="example">
- 暂存工作区
 $ git stash
- 拉取远程代码
 $ git pull origin master
- 还原最近一次工作区的内容
 $ git stash pop
- 出现冲突时，解决冲突提交即可
</pre>
</div>
</div>
<div id="outline-container-sec-1-8-7" class="outline-4">
<h4 id="sec-1-8-7"><span class="section-number-4">1.8.7</span> 添加新 ssh<sub>key</sub> 至 Github</h4>
<div class="outline-text-4" id="text-1-8-7">
<pre class="example">
- 检查是否存在 .ssh 文件夹
  $ cd ~/.ssh
- 生成 ssh_key
  $ ssh-keygen -t rsa -C "youremail@email.com"
- 输入密码
- 启动 ssh-agent
  $ eval "$(ssh-agent -s)"
- 添加 ssh_key 到 ssh-agent
  $ ssh-add ~/.ssh/id_rsa
- 将 id_rsa.pub 中的key添加进 Github 中
  github &gt;&gt; Settings &gt;&gt; SSH and GPG keys &gt;&gt; new SSH key
- 测试联通性
  $ ssh git@github.com
  Hi Saisimon! You've successfully authenticated, but GitHub does not provide shell access.
  Connection to github.com closed.
</pre>
</div>
</div>
<div id="outline-container-sec-1-8-8" class="outline-4">
<h4 id="sec-1-8-8"><span class="section-number-4">1.8.8</span> Git status 输出中文为 UNICODE 解决方法</h4>
<div class="outline-text-4" id="text-1-8-8">
<ul class="org-ul">
<li>修改 git config 属性
<pre class="example">
$ git config --global core.quotepath false
</pre>
</li>
<li>修改修改 git 配置文件
<pre class="example">
$ vi ~/.gitconfig
  [core]
      quotepath = false
</pre>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="http://blog.saisimon.net">Saisimon</a></p>
<p class="date">Created: 2016-09-28 Wed 11:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>